x_train shape: (1000, 32, 32, 3) - y_train shape: (1000, 1)
x_test shape: (1000, 32, 32, 3) - y_test shape: (1000, 1)
Model: "cifar-encoder_with_projection-head"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 32, 32, 3)]       0         
                                                                 
 sequential_1 (Sequential)   (None, 2048)              288800    
                                                                 
 dense (Dense)               (None, 128)               262272    
                                                                 
=================================================================
Total params: 551072 (2.10 MB)
Trainable params: 550176 (2.10 MB)
Non-trainable params: 896 (3.50 KB)
_________________________________________________________________
1/4 [======>.......................] - ETA: 3s - loss: 1641.01622/4 [==============>...............] - ETA: 0s - loss: 1575.01923/4 [=====================>........] - ETA: 0s - loss: 1540.07684/4 [==============================] - ETA: 0s - loss: 1445.72304/4 [==============================] - 2s 280ms/step - loss: 1445.7230
1/4 [======>.......................] - ETA: 1s - loss: 46.0346 - sparse_categorical_accuracy: 0.12832/4 [==============>...............] - ETA: 0s - loss: 52.3148 - sparse_categorical_accuracy: 0.12083/4 [=====================>........] - ETA: 0s - loss: 52.8499 - sparse_categorical_accuracy: 0.11574/4 [==============================] - ETA: 0s - loss: 50.2633 - sparse_categorical_accuracy: 0.11504/4 [==============================] - 1s 78ms/step - loss: 50.2633 - sparse_categorical_accuracy: 0.1150
 1/32 [..............................] - ETA: 3s - loss: 11.8062 - sparse_categorical_accuracy: 0.1562 6/32 [====>.........................] - ETA: 0s - loss: 10.5495 - sparse_categorical_accuracy: 0.171911/32 [=========>....................] - ETA: 0s - loss: 10.7985 - sparse_categorical_accuracy: 0.150616/32 [==============>...............] - ETA: 0s - loss: 10.9340 - sparse_categorical_accuracy: 0.136721/32 [==================>...........] - ETA: 0s - loss: 11.0888 - sparse_categorical_accuracy: 0.132426/32 [=======================>......] - ETA: 0s - loss: 11.0162 - sparse_categorical_accuracy: 0.143031/32 [============================>.] - ETA: 0s - loss: 10.9602 - sparse_categorical_accuracy: 0.137132/32 [==============================] - 0s 11ms/step - loss: 10.9158 - sparse_categorical_accuracy: 0.1390
Test accuracy: 13.9%
