x_train shape: (1000, 32, 32, 3) - y_train shape: (1000, 1)
x_test shape: (1000, 32, 32, 3) - y_test shape: (1000, 1)
Model: "cifar-encoder_with_projection-head"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_3 (InputLayer)        [(None, 32, 32, 3)]       0         
                                                                 
 cifar10-encoder (Functiona  (None, 2048)              23564807  
 l)                                                              
                                                                 
 dense (Dense)               (None, 128)               262272    
                                                                 
=================================================================
Total params: 23827079 (90.89 MB)
Trainable params: 23781632 (90.72 MB)
Non-trainable params: 45447 (177.53 KB)
_________________________________________________________________
Epoch 1/5
1/4 [======>.......................] - ETA: 24s - loss: 9.45502/4 [==============>...............] - ETA: 5s - loss: 8.0684 3/4 [=====================>........] - ETA: 2s - loss: 7.28544/4 [==============================] - ETA: 0s - loss: 6.87154/4 [==============================] - 15s 2s/step - loss: 6.8715
Epoch 2/5
1/4 [======>.......................] - ETA: 7s - loss: 5.55062/4 [==============>...............] - ETA: 4s - loss: 5.54193/4 [=====================>........] - ETA: 2s - loss: 5.53704/4 [==============================] - ETA: 0s - loss: 5.48024/4 [==============================] - 9s 2s/step - loss: 5.4802
Epoch 3/5
1/4 [======>.......................] - ETA: 7s - loss: 5.49952/4 [==============>...............] - ETA: 4s - loss: 5.50113/4 [=====================>........] - ETA: 2s - loss: 5.50004/4 [==============================] - ETA: 0s - loss: 5.44494/4 [==============================] - 9s 2s/step - loss: 5.4449
Epoch 4/5
1/4 [======>.......................] - ETA: 7s - loss: 5.44662/4 [==============>...............] - ETA: 4s - loss: 5.45413/4 [=====================>........] - ETA: 2s - loss: 5.45354/4 [==============================] - ETA: 0s - loss: 5.38534/4 [==============================] - 9s 2s/step - loss: 5.3853
Epoch 5/5
1/4 [======>.......................] - ETA: 7s - loss: 5.33722/4 [==============>...............] - ETA: 4s - loss: 5.34483/4 [=====================>........] - ETA: 2s - loss: 5.33824/4 [==============================] - ETA: 0s - loss: 5.30774/4 [==============================] - 9s 2s/step - loss: 5.3077
Epoch 1/5
1/4 [======>.......................] - ETA: 3s - loss: 2.3114 - sparse_categorical_accuracy: 0.07552/4 [==============>...............] - ETA: 0s - loss: 2.3062 - sparse_categorical_accuracy: 0.09433/4 [=====================>........] - ETA: 0s - loss: 2.3037 - sparse_categorical_accuracy: 0.09564/4 [==============================] - ETA: 0s - loss: 2.3017 - sparse_categorical_accuracy: 0.10504/4 [==============================] - 2s 159ms/step - loss: 2.3017 - sparse_categorical_accuracy: 0.1050
Epoch 2/5
1/4 [======>.......................] - ETA: 0s - loss: 2.2700 - sparse_categorical_accuracy: 0.09062/4 [==============>...............] - ETA: 0s - loss: 2.2563 - sparse_categorical_accuracy: 0.12083/4 [=====================>........] - ETA: 0s - loss: 2.2567 - sparse_categorical_accuracy: 0.12334/4 [==============================] - ETA: 0s - loss: 2.2545 - sparse_categorical_accuracy: 0.13204/4 [==============================] - 1s 156ms/step - loss: 2.2545 - sparse_categorical_accuracy: 0.1320
Epoch 3/5
1/4 [======>.......................] - ETA: 0s - loss: 2.2265 - sparse_categorical_accuracy: 0.20002/4 [==============>...............] - ETA: 0s - loss: 2.2306 - sparse_categorical_accuracy: 0.20003/4 [=====================>........] - ETA: 0s - loss: 2.2241 - sparse_categorical_accuracy: 0.18744/4 [==============================] - ETA: 0s - loss: 2.2246 - sparse_categorical_accuracy: 0.17804/4 [==============================] - 1s 163ms/step - loss: 2.2246 - sparse_categorical_accuracy: 0.1780
Epoch 4/5
1/4 [======>.......................] - ETA: 0s - loss: 2.1772 - sparse_categorical_accuracy: 0.17362/4 [==============>...............] - ETA: 0s - loss: 2.1827 - sparse_categorical_accuracy: 0.17743/4 [=====================>........] - ETA: 0s - loss: 2.1812 - sparse_categorical_accuracy: 0.18494/4 [==============================] - ETA: 0s - loss: 2.1802 - sparse_categorical_accuracy: 0.18204/4 [==============================] - 1s 180ms/step - loss: 2.1802 - sparse_categorical_accuracy: 0.1820
Epoch 5/5
1/4 [======>.......................] - ETA: 0s - loss: 2.1612 - sparse_categorical_accuracy: 0.20382/4 [==============>...............] - ETA: 0s - loss: 2.1411 - sparse_categorical_accuracy: 0.20943/4 [=====================>........] - ETA: 0s - loss: 2.1541 - sparse_categorical_accuracy: 0.19624/4 [==============================] - ETA: 0s - loss: 2.1516 - sparse_categorical_accuracy: 0.20204/4 [==============================] - 1s 161ms/step - loss: 2.1516 - sparse_categorical_accuracy: 0.2020
 1/32 [..............................] - ETA: 12s - loss: 2.0716 - sparse_categorical_accuracy: 0.2500 3/32 [=>............................] - ETA: 0s - loss: 2.1484 - sparse_categorical_accuracy: 0.1771  5/32 [===>..........................] - ETA: 0s - loss: 2.1510 - sparse_categorical_accuracy: 0.1750 7/32 [=====>........................] - ETA: 0s - loss: 2.1608 - sparse_categorical_accuracy: 0.1875 9/32 [=======>......................] - ETA: 0s - loss: 2.1649 - sparse_categorical_accuracy: 0.173611/32 [=========>....................] - ETA: 0s - loss: 2.1548 - sparse_categorical_accuracy: 0.184713/32 [===========>..................] - ETA: 0s - loss: 2.1476 - sparse_categorical_accuracy: 0.192315/32 [=============>................] - ETA: 0s - loss: 2.1515 - sparse_categorical_accuracy: 0.189617/32 [==============>...............] - ETA: 0s - loss: 2.1437 - sparse_categorical_accuracy: 0.196719/32 [================>.............] - ETA: 0s - loss: 2.1406 - sparse_categorical_accuracy: 0.205621/32 [==================>...........] - ETA: 0s - loss: 2.1439 - sparse_categorical_accuracy: 0.208323/32 [====================>.........] - ETA: 0s - loss: 2.1511 - sparse_categorical_accuracy: 0.206525/32 [======================>.......] - ETA: 0s - loss: 2.1546 - sparse_categorical_accuracy: 0.211327/32 [========================>.....] - ETA: 0s - loss: 2.1589 - sparse_categorical_accuracy: 0.204929/32 [==========================>...] - ETA: 0s - loss: 2.1565 - sparse_categorical_accuracy: 0.200431/32 [============================>.] - ETA: 0s - loss: 2.1547 - sparse_categorical_accuracy: 0.202632/32 [==============================] - 1s 33ms/step - loss: 2.1546 - sparse_categorical_accuracy: 0.2040
Test accuracy: 20.4%
