x_train shape: (1000, 32, 32, 3) - y_train shape: (1000, 1)
x_test shape: (1000, 32, 32, 3) - y_test shape: (1000, 1)
Model: "cifar-encoder_with_projection-head"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_3 (InputLayer)        [(None, 32, 32, 3)]       0         
                                                                 
 cifar10-encoder (Functiona  (None, 2048)              23564807  
 l)                                                              
                                                                 
 dense (Dense)               (None, 128)               262272    
                                                                 
=================================================================
Total params: 23827079 (90.89 MB)
Trainable params: 23781632 (90.72 MB)
Non-trainable params: 45447 (177.53 KB)
_________________________________________________________________
1/4 [======>.......................] - ETA: 19s - loss: 1677.96882/4 [==============>...............] - ETA: 3s - loss: 1667.1964 3/4 [=====================>........] - ETA: 1s - loss: 1617.68274/4 [==============================] - ETA: 0s - loss: 1510.06924/4 [==============================] - 12s 2s/step - loss: 1510.0692
1/4 [======>.......................] - ETA: 4s - loss: 2.2997 - sparse_categorical_accuracy: 0.10192/4 [==============>...............] - ETA: 0s - loss: 2.3006 - sparse_categorical_accuracy: 0.09623/4 [=====================>........] - ETA: 0s - loss: 2.2973 - sparse_categorical_accuracy: 0.09694/4 [==============================] - ETA: 0s - loss: 2.2936 - sparse_categorical_accuracy: 0.10504/4 [==============================] - 2s 156ms/step - loss: 2.2936 - sparse_categorical_accuracy: 0.1050
 1/32 [..............................] - ETA: 11s - loss: 2.2253 - sparse_categorical_accuracy: 0.0625 3/32 [=>............................] - ETA: 0s - loss: 2.2639 - sparse_categorical_accuracy: 0.1146  5/32 [===>..........................] - ETA: 0s - loss: 2.2725 - sparse_categorical_accuracy: 0.1063 7/32 [=====>........................] - ETA: 0s - loss: 2.2717 - sparse_categorical_accuracy: 0.1205 9/32 [=======>......................] - ETA: 0s - loss: 2.2693 - sparse_categorical_accuracy: 0.121511/32 [=========>....................] - ETA: 0s - loss: 2.2660 - sparse_categorical_accuracy: 0.133513/32 [===========>..................] - ETA: 0s - loss: 2.2648 - sparse_categorical_accuracy: 0.141815/32 [=============>................] - ETA: 0s - loss: 2.2669 - sparse_categorical_accuracy: 0.139617/32 [==============>...............] - ETA: 0s - loss: 2.2617 - sparse_categorical_accuracy: 0.143419/32 [================>.............] - ETA: 0s - loss: 2.2622 - sparse_categorical_accuracy: 0.144721/32 [==================>...........] - ETA: 0s - loss: 2.2601 - sparse_categorical_accuracy: 0.144323/32 [====================>.........] - ETA: 0s - loss: 2.2639 - sparse_categorical_accuracy: 0.141325/32 [======================>.......] - ETA: 0s - loss: 2.2635 - sparse_categorical_accuracy: 0.148827/32 [========================>.....] - ETA: 0s - loss: 2.2648 - sparse_categorical_accuracy: 0.143529/32 [==========================>...] - ETA: 0s - loss: 2.2647 - sparse_categorical_accuracy: 0.141231/32 [============================>.] - ETA: 0s - loss: 2.2617 - sparse_categorical_accuracy: 0.147232/32 [==============================] - 1s 30ms/step - loss: 2.2620 - sparse_categorical_accuracy: 0.1460
Test accuracy: 14.6%
