x_train shape: (1000, 32, 32, 3) - y_train shape: (1000, 1)
x_test shape: (1000, 32, 32, 3) - y_test shape: (1000, 1)
Model: "cifar-encoder_with_projection-head"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_3 (InputLayer)        [(None, 32, 32, 3)]       0         
                                                                 
 cifar10-encoder (Functiona  (None, 2048)              23564807  
 l)                                                              
                                                                 
 dense (Dense)               (None, 128)               262272    
                                                                 
=================================================================
Total params: 23827079 (90.89 MB)
Trainable params: 23781632 (90.72 MB)
Non-trainable params: 45447 (177.53 KB)
_________________________________________________________________
Epoch 1/10
1/4 [======>.......................] - ETA: 21s - loss: 9.80342/4 [==============>...............] - ETA: 5s - loss: 8.5321 3/4 [=====================>........] - ETA: 2s - loss: 7.59514/4 [==============================] - ETA: 0s - loss: 7.11824/4 [==============================] - 14s 2s/step - loss: 7.1182
Epoch 2/10
1/4 [======>.......................] - ETA: 7s - loss: 5.57112/4 [==============>...............] - ETA: 5s - loss: 5.54783/4 [=====================>........] - ETA: 2s - loss: 5.53564/4 [==============================] - ETA: 0s - loss: 5.47774/4 [==============================] - 10s 2s/step - loss: 5.4777
Epoch 3/10
1/4 [======>.......................] - ETA: 7s - loss: 5.50342/4 [==============>...............] - ETA: 5s - loss: 5.50173/4 [=====================>........] - ETA: 2s - loss: 5.49704/4 [==============================] - ETA: 0s - loss: 5.43914/4 [==============================] - 9s 2s/step - loss: 5.4391
Epoch 4/10
1/4 [======>.......................] - ETA: 6s - loss: 5.45732/4 [==============>...............] - ETA: 5s - loss: 5.42763/4 [=====================>........] - ETA: 2s - loss: 5.44414/4 [==============================] - ETA: 0s - loss: 5.37634/4 [==============================] - 10s 3s/step - loss: 5.3763
Epoch 5/10
1/4 [======>.......................] - ETA: 7s - loss: 5.39192/4 [==============>...............] - ETA: 4s - loss: 5.36443/4 [=====================>........] - ETA: 2s - loss: 5.35794/4 [==============================] - ETA: 0s - loss: 5.32144/4 [==============================] - 9s 2s/step - loss: 5.3214
Epoch 6/10
1/4 [======>.......................] - ETA: 6s - loss: 5.29142/4 [==============>...............] - ETA: 4s - loss: 5.29903/4 [=====================>........] - ETA: 2s - loss: 5.29714/4 [==============================] - ETA: 0s - loss: 5.23734/4 [==============================] - 9s 2s/step - loss: 5.2373
Epoch 7/10
1/4 [======>.......................] - ETA: 6s - loss: 5.19392/4 [==============>...............] - ETA: 4s - loss: 5.21423/4 [=====================>........] - ETA: 2s - loss: 5.18644/4 [==============================] - ETA: 0s - loss: 5.14004/4 [==============================] - 9s 2s/step - loss: 5.1400
Epoch 8/10
1/4 [======>.......................] - ETA: 6s - loss: 5.14382/4 [==============>...............] - ETA: 4s - loss: 5.12463/4 [=====================>........] - ETA: 2s - loss: 5.11914/4 [==============================] - ETA: 0s - loss: 5.10024/4 [==============================] - 9s 2s/step - loss: 5.1002
Epoch 9/10
1/4 [======>.......................] - ETA: 6s - loss: 5.02472/4 [==============>...............] - ETA: 4s - loss: 5.09583/4 [=====================>........] - ETA: 2s - loss: 5.10474/4 [==============================] - ETA: 0s - loss: 5.08484/4 [==============================] - 9s 2s/step - loss: 5.0848
Epoch 10/10
1/4 [======>.......................] - ETA: 7s - loss: 5.03602/4 [==============>...............] - ETA: 5s - loss: 5.04173/4 [=====================>........] - ETA: 2s - loss: 5.05054/4 [==============================] - ETA: 0s - loss: 5.01044/4 [==============================] - 11s 3s/step - loss: 5.0104
Epoch 1/10
1/4 [======>.......................] - ETA: 4s - loss: 2.2981 - sparse_categorical_accuracy: 0.10942/4 [==============>...............] - ETA: 0s - loss: 2.3047 - sparse_categorical_accuracy: 0.12263/4 [=====================>........] - ETA: 0s - loss: 2.3080 - sparse_categorical_accuracy: 0.12084/4 [==============================] - ETA: 0s - loss: 2.2957 - sparse_categorical_accuracy: 0.12604/4 [==============================] - 2s 306ms/step - loss: 2.2957 - sparse_categorical_accuracy: 0.1260
Epoch 2/10
1/4 [======>.......................] - ETA: 0s - loss: 2.2186 - sparse_categorical_accuracy: 0.20002/4 [==============>...............] - ETA: 0s - loss: 2.2046 - sparse_categorical_accuracy: 0.19433/4 [=====================>........] - ETA: 0s - loss: 2.2059 - sparse_categorical_accuracy: 0.18624/4 [==============================] - ETA: 0s - loss: 2.2031 - sparse_categorical_accuracy: 0.18504/4 [==============================] - 1s 274ms/step - loss: 2.2031 - sparse_categorical_accuracy: 0.1850
Epoch 3/10
1/4 [======>.......................] - ETA: 0s - loss: 2.1637 - sparse_categorical_accuracy: 0.20382/4 [==============>...............] - ETA: 0s - loss: 2.1467 - sparse_categorical_accuracy: 0.20753/4 [=====================>........] - ETA: 0s - loss: 2.1408 - sparse_categorical_accuracy: 0.21014/4 [==============================] - ETA: 0s - loss: 2.1353 - sparse_categorical_accuracy: 0.20904/4 [==============================] - 1s 260ms/step - loss: 2.1353 - sparse_categorical_accuracy: 0.2090
Epoch 4/10
1/4 [======>.......................] - ETA: 0s - loss: 2.1574 - sparse_categorical_accuracy: 0.20382/4 [==============>...............] - ETA: 0s - loss: 2.1205 - sparse_categorical_accuracy: 0.22453/4 [=====================>........] - ETA: 0s - loss: 2.1032 - sparse_categorical_accuracy: 0.23274/4 [==============================] - ETA: 0s - loss: 2.0857 - sparse_categorical_accuracy: 0.24004/4 [==============================] - 1s 252ms/step - loss: 2.0857 - sparse_categorical_accuracy: 0.2400
Epoch 5/10
1/4 [======>.......................] - ETA: 0s - loss: 2.0782 - sparse_categorical_accuracy: 0.20752/4 [==============>...............] - ETA: 0s - loss: 2.0409 - sparse_categorical_accuracy: 0.25663/4 [=====================>........] - ETA: 0s - loss: 2.0529 - sparse_categorical_accuracy: 0.24654/4 [==============================] - ETA: 0s - loss: 2.0548 - sparse_categorical_accuracy: 0.25004/4 [==============================] - 1s 259ms/step - loss: 2.0548 - sparse_categorical_accuracy: 0.2500
Epoch 6/10
1/4 [======>.......................] - ETA: 0s - loss: 2.0076 - sparse_categorical_accuracy: 0.21892/4 [==============>...............] - ETA: 0s - loss: 2.0080 - sparse_categorical_accuracy: 0.23773/4 [=====================>........] - ETA: 0s - loss: 2.0351 - sparse_categorical_accuracy: 0.22644/4 [==============================] - ETA: 0s - loss: 2.0266 - sparse_categorical_accuracy: 0.22804/4 [==============================] - 1s 272ms/step - loss: 2.0266 - sparse_categorical_accuracy: 0.2280
Epoch 7/10
1/4 [======>.......................] - ETA: 0s - loss: 2.0482 - sparse_categorical_accuracy: 0.23402/4 [==============>...............] - ETA: 0s - loss: 2.0461 - sparse_categorical_accuracy: 0.23023/4 [=====================>........] - ETA: 0s - loss: 2.0242 - sparse_categorical_accuracy: 0.23654/4 [==============================] - ETA: 0s - loss: 2.0045 - sparse_categorical_accuracy: 0.24804/4 [==============================] - 1s 266ms/step - loss: 2.0045 - sparse_categorical_accuracy: 0.2480
Epoch 8/10
1/4 [======>.......................] - ETA: 0s - loss: 1.9648 - sparse_categorical_accuracy: 0.27922/4 [==============>...............] - ETA: 0s - loss: 1.9673 - sparse_categorical_accuracy: 0.26983/4 [=====================>........] - ETA: 0s - loss: 1.9548 - sparse_categorical_accuracy: 0.26924/4 [==============================] - ETA: 0s - loss: 1.9657 - sparse_categorical_accuracy: 0.27304/4 [==============================] - 1s 292ms/step - loss: 1.9657 - sparse_categorical_accuracy: 0.2730
Epoch 9/10
1/4 [======>.......................] - ETA: 0s - loss: 1.9976 - sparse_categorical_accuracy: 0.26422/4 [==============>...............] - ETA: 0s - loss: 2.0003 - sparse_categorical_accuracy: 0.26043/4 [=====================>........] - ETA: 0s - loss: 1.9625 - sparse_categorical_accuracy: 0.26544/4 [==============================] - ETA: 0s - loss: 1.9684 - sparse_categorical_accuracy: 0.26104/4 [==============================] - 1s 313ms/step - loss: 1.9684 - sparse_categorical_accuracy: 0.2610
Epoch 10/10
1/4 [======>.......................] - ETA: 1s - loss: 1.9103 - sparse_categorical_accuracy: 0.27922/4 [==============>...............] - ETA: 0s - loss: 1.8900 - sparse_categorical_accuracy: 0.29063/4 [=====================>........] - ETA: 0s - loss: 1.9044 - sparse_categorical_accuracy: 0.29314/4 [==============================] - ETA: 0s - loss: 1.9118 - sparse_categorical_accuracy: 0.29304/4 [==============================] - 1s 339ms/step - loss: 1.9118 - sparse_categorical_accuracy: 0.2930
 1/32 [..............................] - ETA: 25s - loss: 1.8610 - sparse_categorical_accuracy: 0.3750 3/32 [=>............................] - ETA: 1s - loss: 2.0221 - sparse_categorical_accuracy: 0.2083  5/32 [===>..........................] - ETA: 1s - loss: 2.0118 - sparse_categorical_accuracy: 0.2250 7/32 [=====>........................] - ETA: 1s - loss: 2.0230 - sparse_categorical_accuracy: 0.2232 9/32 [=======>......................] - ETA: 1s - loss: 2.0186 - sparse_categorical_accuracy: 0.225711/32 [=========>....................] - ETA: 0s - loss: 1.9809 - sparse_categorical_accuracy: 0.250012/32 [==========>...................] - ETA: 0s - loss: 1.9871 - sparse_categorical_accuracy: 0.252613/32 [===========>..................] - ETA: 0s - loss: 1.9843 - sparse_categorical_accuracy: 0.245214/32 [============>.................] - ETA: 0s - loss: 1.9829 - sparse_categorical_accuracy: 0.245516/32 [==============>...............] - ETA: 0s - loss: 1.9710 - sparse_categorical_accuracy: 0.242217/32 [==============>...............] - ETA: 0s - loss: 1.9643 - sparse_categorical_accuracy: 0.248218/32 [===============>..............] - ETA: 0s - loss: 1.9599 - sparse_categorical_accuracy: 0.248319/32 [================>.............] - ETA: 0s - loss: 1.9695 - sparse_categorical_accuracy: 0.246720/32 [=================>............] - ETA: 0s - loss: 1.9707 - sparse_categorical_accuracy: 0.251621/32 [==================>...........] - ETA: 0s - loss: 1.9671 - sparse_categorical_accuracy: 0.254522/32 [===================>..........] - ETA: 0s - loss: 1.9741 - sparse_categorical_accuracy: 0.252823/32 [====================>.........] - ETA: 0s - loss: 1.9798 - sparse_categorical_accuracy: 0.248624/32 [=====================>........] - ETA: 0s - loss: 1.9801 - sparse_categorical_accuracy: 0.250025/32 [======================>.......] - ETA: 0s - loss: 1.9825 - sparse_categorical_accuracy: 0.253726/32 [=======================>......] - ETA: 0s - loss: 1.9844 - sparse_categorical_accuracy: 0.252427/32 [========================>.....] - ETA: 0s - loss: 1.9825 - sparse_categorical_accuracy: 0.254628/32 [=========================>....] - ETA: 0s - loss: 1.9909 - sparse_categorical_accuracy: 0.253329/32 [==========================>...] - ETA: 0s - loss: 1.9976 - sparse_categorical_accuracy: 0.251130/32 [===========================>..] - ETA: 0s - loss: 1.9981 - sparse_categorical_accuracy: 0.251031/32 [============================>.] - ETA: 0s - loss: 1.9941 - sparse_categorical_accuracy: 0.256032/32 [==============================] - 3s 55ms/step - loss: 1.9929 - sparse_categorical_accuracy: 0.2570
Test accuracy: 25.7%
