x_train shape: (50000, 32, 32, 3) - y_train shape: (50000, 1)
x_test shape: (10000, 32, 32, 3) - y_test shape: (10000, 1)
Model: "cifar-encoder_with_projection-head"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_3 (InputLayer)        [(None, 32, 32, 3)]       0         
                                                                 
 cifar10-encoder (Functiona  (None, 2048)              23564807  
 l)                                                              
                                                                 
 dense (Dense)               (None, 128)               262272    
                                                                 
=================================================================
Total params: 23827079 (90.89 MB)
Trainable params: 23781632 (90.72 MB)
Non-trainable params: 45447 (177.53 KB)
_________________________________________________________________
  1/313 [..............................] - ETA: 3:04 - loss: 1.0245 - sparse_categorical_accuracy: 0.6562  3/313 [..............................] - ETA: 10s - loss: 1.1514 - sparse_categorical_accuracy: 0.5833   5/313 [..............................] - ETA: 9s - loss: 1.2118 - sparse_categorical_accuracy: 0.5250   7/313 [..............................] - ETA: 9s - loss: 1.2678 - sparse_categorical_accuracy: 0.5268  9/313 [..............................] - ETA: 9s - loss: 1.2751 - sparse_categorical_accuracy: 0.5243 11/313 [>.............................] - ETA: 9s - loss: 1.2368 - sparse_categorical_accuracy: 0.5312 13/313 [>.............................] - ETA: 9s - loss: 1.2592 - sparse_categorical_accuracy: 0.5361 15/313 [>.............................] - ETA: 9s - loss: 1.2785 - sparse_categorical_accuracy: 0.5271 17/313 [>.............................] - ETA: 9s - loss: 1.2488 - sparse_categorical_accuracy: 0.5349 19/313 [>.............................] - ETA: 9s - loss: 1.2265 - sparse_categorical_accuracy: 0.5444 21/313 [=>............................] - ETA: 9s - loss: 1.2199 - sparse_categorical_accuracy: 0.5476 23/313 [=>............................] - ETA: 9s - loss: 1.2463 - sparse_categorical_accuracy: 0.5462 25/313 [=>............................] - ETA: 9s - loss: 1.2567 - sparse_categorical_accuracy: 0.5450 27/313 [=>............................] - ETA: 9s - loss: 1.2457 - sparse_categorical_accuracy: 0.5498 29/313 [=>............................] - ETA: 9s - loss: 1.2450 - sparse_categorical_accuracy: 0.5528 31/313 [=>............................] - ETA: 9s - loss: 1.2311 - sparse_categorical_accuracy: 0.5595 33/313 [==>...........................] - ETA: 9s - loss: 1.2349 - sparse_categorical_accuracy: 0.5606 35/313 [==>...........................] - ETA: 9s - loss: 1.2262 - sparse_categorical_accuracy: 0.5634 37/313 [==>...........................] - ETA: 9s - loss: 1.2274 - sparse_categorical_accuracy: 0.5633 39/313 [==>...........................] - ETA: 9s - loss: 1.2246 - sparse_categorical_accuracy: 0.5641 41/313 [==>...........................] - ETA: 9s - loss: 1.2353 - sparse_categorical_accuracy: 0.5579 43/313 [===>..........................] - ETA: 9s - loss: 1.2339 - sparse_categorical_accuracy: 0.5581 45/313 [===>..........................] - ETA: 9s - loss: 1.2309 - sparse_categorical_accuracy: 0.5562 47/313 [===>..........................] - ETA: 9s - loss: 1.2209 - sparse_categorical_accuracy: 0.5625 49/313 [===>..........................] - ETA: 9s - loss: 1.2228 - sparse_categorical_accuracy: 0.5619 51/313 [===>..........................] - ETA: 9s - loss: 1.2322 - sparse_categorical_accuracy: 0.5570 53/313 [====>.........................] - ETA: 9s - loss: 1.2229 - sparse_categorical_accuracy: 0.5596 55/313 [====>.........................] - ETA: 9s - loss: 1.2279 - sparse_categorical_accuracy: 0.5568 57/313 [====>.........................] - ETA: 9s - loss: 1.2268 - sparse_categorical_accuracy: 0.5559 59/313 [====>.........................] - ETA: 9s - loss: 1.2332 - sparse_categorical_accuracy: 0.5556 61/313 [====>.........................] - ETA: 9s - loss: 1.2370 - sparse_categorical_accuracy: 0.5543 63/313 [=====>........................] - ETA: 8s - loss: 1.2417 - sparse_categorical_accuracy: 0.5531 65/313 [=====>........................] - ETA: 8s - loss: 1.2438 - sparse_categorical_accuracy: 0.5514 67/313 [=====>........................] - ETA: 8s - loss: 1.2402 - sparse_categorical_accuracy: 0.5532 69/313 [=====>........................] - ETA: 8s - loss: 1.2417 - sparse_categorical_accuracy: 0.5530 71/313 [=====>........................] - ETA: 8s - loss: 1.2434 - sparse_categorical_accuracy: 0.5528 73/313 [=====>........................] - ETA: 8s - loss: 1.2471 - sparse_categorical_accuracy: 0.5492 75/313 [======>.......................] - ETA: 8s - loss: 1.2453 - sparse_categorical_accuracy: 0.5496 77/313 [======>.......................] - ETA: 8s - loss: 1.2449 - sparse_categorical_accuracy: 0.5487 79/313 [======>.......................] - ETA: 8s - loss: 1.2523 - sparse_categorical_accuracy: 0.5471 81/313 [======>.......................] - ETA: 8s - loss: 1.2582 - sparse_categorical_accuracy: 0.5455 83/313 [======>.......................] - ETA: 8s - loss: 1.2592 - sparse_categorical_accuracy: 0.5441 85/313 [=======>......................] - ETA: 8s - loss: 1.2588 - sparse_categorical_accuracy: 0.5437 87/313 [=======>......................] - ETA: 8s - loss: 1.2606 - sparse_categorical_accuracy: 0.5409 89/313 [=======>......................] - ETA: 8s - loss: 1.2641 - sparse_categorical_accuracy: 0.5393 91/313 [=======>......................] - ETA: 8s - loss: 1.2663 - sparse_categorical_accuracy: 0.5398 93/313 [=======>......................] - ETA: 7s - loss: 1.2636 - sparse_categorical_accuracy: 0.5407 95/313 [========>.....................] - ETA: 7s - loss: 1.2654 - sparse_categorical_accuracy: 0.5405 97/313 [========>.....................] - ETA: 7s - loss: 1.2643 - sparse_categorical_accuracy: 0.5403 99/313 [========>.....................] - ETA: 7s - loss: 1.2612 - sparse_categorical_accuracy: 0.5417101/313 [========>.....................] - ETA: 7s - loss: 1.2646 - sparse_categorical_accuracy: 0.5399103/313 [========>.....................] - ETA: 7s - loss: 1.2606 - sparse_categorical_accuracy: 0.5410105/313 [=========>....................] - ETA: 7s - loss: 1.2663 - sparse_categorical_accuracy: 0.5405107/313 [=========>....................] - ETA: 7s - loss: 1.2678 - sparse_categorical_accuracy: 0.5397109/313 [=========>....................] - ETA: 7s - loss: 1.2652 - sparse_categorical_accuracy: 0.5410111/313 [=========>....................] - ETA: 7s - loss: 1.2683 - sparse_categorical_accuracy: 0.5405113/313 [=========>....................] - ETA: 7s - loss: 1.2682 - sparse_categorical_accuracy: 0.5407115/313 [==========>...................] - ETA: 7s - loss: 1.2688 - sparse_categorical_accuracy: 0.5397117/313 [==========>...................] - ETA: 7s - loss: 1.2680 - sparse_categorical_accuracy: 0.5398119/313 [==========>...................] - ETA: 7s - loss: 1.2664 - sparse_categorical_accuracy: 0.5399121/313 [==========>...................] - ETA: 6s - loss: 1.2635 - sparse_categorical_accuracy: 0.5403123/313 [==========>...................] - ETA: 6s - loss: 1.2623 - sparse_categorical_accuracy: 0.5407125/313 [==========>...................] - ETA: 6s - loss: 1.2637 - sparse_categorical_accuracy: 0.5415127/313 [===========>..................] - ETA: 6s - loss: 1.2660 - sparse_categorical_accuracy: 0.5408129/313 [===========>..................] - ETA: 6s - loss: 1.2667 - sparse_categorical_accuracy: 0.5397131/313 [===========>..................] - ETA: 6s - loss: 1.2665 - sparse_categorical_accuracy: 0.5408133/313 [===========>..................] - ETA: 6s - loss: 1.2627 - sparse_categorical_accuracy: 0.5421135/313 [===========>..................] - ETA: 6s - loss: 1.2668 - sparse_categorical_accuracy: 0.5407137/313 [============>.................] - ETA: 6s - loss: 1.2628 - sparse_categorical_accuracy: 0.5417139/313 [============>.................] - ETA: 6s - loss: 1.2646 - sparse_categorical_accuracy: 0.5414141/313 [============>.................] - ETA: 6s - loss: 1.2651 - sparse_categorical_accuracy: 0.5410143/313 [============>.................] - ETA: 6s - loss: 1.2663 - sparse_categorical_accuracy: 0.5404145/313 [============>.................] - ETA: 6s - loss: 1.2669 - sparse_categorical_accuracy: 0.5397147/313 [=============>................] - ETA: 5s - loss: 1.2655 - sparse_categorical_accuracy: 0.5404149/313 [=============>................] - ETA: 5s - loss: 1.2649 - sparse_categorical_accuracy: 0.5411151/313 [=============>................] - ETA: 5s - loss: 1.2628 - sparse_categorical_accuracy: 0.5420153/313 [=============>................] - ETA: 5s - loss: 1.2593 - sparse_categorical_accuracy: 0.5431155/313 [=============>................] - ETA: 5s - loss: 1.2558 - sparse_categorical_accuracy: 0.5446157/313 [==============>...............] - ETA: 5s - loss: 1.2548 - sparse_categorical_accuracy: 0.5446159/313 [==============>...............] - ETA: 5s - loss: 1.2539 - sparse_categorical_accuracy: 0.5442161/313 [==============>...............] - ETA: 5s - loss: 1.2564 - sparse_categorical_accuracy: 0.5444163/313 [==============>...............] - ETA: 5s - loss: 1.2557 - sparse_categorical_accuracy: 0.5456165/313 [==============>...............] - ETA: 5s - loss: 1.2542 - sparse_categorical_accuracy: 0.5462167/313 [===============>..............] - ETA: 5s - loss: 1.2531 - sparse_categorical_accuracy: 0.5464169/313 [===============>..............] - ETA: 5s - loss: 1.2539 - sparse_categorical_accuracy: 0.5466171/313 [===============>..............] - ETA: 5s - loss: 1.2550 - sparse_categorical_accuracy: 0.5464173/313 [===============>..............] - ETA: 5s - loss: 1.2584 - sparse_categorical_accuracy: 0.5448175/313 [===============>..............] - ETA: 4s - loss: 1.2591 - sparse_categorical_accuracy: 0.5448177/313 [===============>..............] - ETA: 4s - loss: 1.2631 - sparse_categorical_accuracy: 0.5436179/313 [================>.............] - ETA: 4s - loss: 1.2599 - sparse_categorical_accuracy: 0.5443181/313 [================>.............] - ETA: 4s - loss: 1.2578 - sparse_categorical_accuracy: 0.5447183/313 [================>.............] - ETA: 4s - loss: 1.2607 - sparse_categorical_accuracy: 0.5432185/313 [================>.............] - ETA: 4s - loss: 1.2616 - sparse_categorical_accuracy: 0.5421187/313 [================>.............] - ETA: 4s - loss: 1.2595 - sparse_categorical_accuracy: 0.5433189/313 [=================>............] - ETA: 4s - loss: 1.2610 - sparse_categorical_accuracy: 0.5423191/313 [=================>............] - ETA: 4s - loss: 1.2612 - sparse_categorical_accuracy: 0.5417193/313 [=================>............] - ETA: 4s - loss: 1.2635 - sparse_categorical_accuracy: 0.5410195/313 [=================>............] - ETA: 4s - loss: 1.2627 - sparse_categorical_accuracy: 0.5413197/313 [=================>............] - ETA: 4s - loss: 1.2620 - sparse_categorical_accuracy: 0.5417199/313 [==================>...........] - ETA: 4s - loss: 1.2612 - sparse_categorical_accuracy: 0.5426201/313 [==================>...........] - ETA: 4s - loss: 1.2622 - sparse_categorical_accuracy: 0.5424203/313 [==================>...........] - ETA: 3s - loss: 1.2615 - sparse_categorical_accuracy: 0.5426205/313 [==================>...........] - ETA: 3s - loss: 1.2611 - sparse_categorical_accuracy: 0.5430207/313 [==================>...........] - ETA: 3s - loss: 1.2620 - sparse_categorical_accuracy: 0.5423209/313 [===================>..........] - ETA: 3s - loss: 1.2625 - sparse_categorical_accuracy: 0.5419211/313 [===================>..........] - ETA: 3s - loss: 1.2633 - sparse_categorical_accuracy: 0.5416213/313 [===================>..........] - ETA: 3s - loss: 1.2624 - sparse_categorical_accuracy: 0.5411215/313 [===================>..........] - ETA: 3s - loss: 1.2631 - sparse_categorical_accuracy: 0.5398217/313 [===================>..........] - ETA: 3s - loss: 1.2641 - sparse_categorical_accuracy: 0.5396219/313 [===================>..........] - ETA: 3s - loss: 1.2657 - sparse_categorical_accuracy: 0.5392221/313 [====================>.........] - ETA: 3s - loss: 1.2652 - sparse_categorical_accuracy: 0.5393223/313 [====================>.........] - ETA: 3s - loss: 1.2657 - sparse_categorical_accuracy: 0.5391225/313 [====================>.........] - ETA: 3s - loss: 1.2639 - sparse_categorical_accuracy: 0.5397227/313 [====================>.........] - ETA: 3s - loss: 1.2641 - sparse_categorical_accuracy: 0.5385229/313 [====================>.........] - ETA: 3s - loss: 1.2617 - sparse_categorical_accuracy: 0.5389231/313 [=====================>........] - ETA: 2s - loss: 1.2602 - sparse_categorical_accuracy: 0.5390233/313 [=====================>........] - ETA: 2s - loss: 1.2614 - sparse_categorical_accuracy: 0.5380235/313 [=====================>........] - ETA: 2s - loss: 1.2590 - sparse_categorical_accuracy: 0.5392237/313 [=====================>........] - ETA: 2s - loss: 1.2584 - sparse_categorical_accuracy: 0.5389239/313 [=====================>........] - ETA: 2s - loss: 1.2589 - sparse_categorical_accuracy: 0.5388241/313 [======================>.......] - ETA: 2s - loss: 1.2578 - sparse_categorical_accuracy: 0.5392243/313 [======================>.......] - ETA: 2s - loss: 1.2570 - sparse_categorical_accuracy: 0.5397245/313 [======================>.......] - ETA: 2s - loss: 1.2582 - sparse_categorical_accuracy: 0.5397247/313 [======================>.......] - ETA: 2s - loss: 1.2566 - sparse_categorical_accuracy: 0.5405249/313 [======================>.......] - ETA: 2s - loss: 1.2576 - sparse_categorical_accuracy: 0.5398251/313 [=======================>......] - ETA: 2s - loss: 1.2573 - sparse_categorical_accuracy: 0.5406253/313 [=======================>......] - ETA: 2s - loss: 1.2565 - sparse_categorical_accuracy: 0.5409255/313 [=======================>......] - ETA: 2s - loss: 1.2576 - sparse_categorical_accuracy: 0.5403257/313 [=======================>......] - ETA: 2s - loss: 1.2583 - sparse_categorical_accuracy: 0.5396259/313 [=======================>......] - ETA: 1s - loss: 1.2594 - sparse_categorical_accuracy: 0.5386261/313 [========================>.....] - ETA: 1s - loss: 1.2615 - sparse_categorical_accuracy: 0.5381263/313 [========================>.....] - ETA: 1s - loss: 1.2615 - sparse_categorical_accuracy: 0.5375265/313 [========================>.....] - ETA: 1s - loss: 1.2640 - sparse_categorical_accuracy: 0.5371267/313 [========================>.....] - ETA: 1s - loss: 1.2650 - sparse_categorical_accuracy: 0.5372269/313 [========================>.....] - ETA: 1s - loss: 1.2642 - sparse_categorical_accuracy: 0.5372271/313 [========================>.....] - ETA: 1s - loss: 1.2648 - sparse_categorical_accuracy: 0.5368273/313 [=========================>....] - ETA: 1s - loss: 1.2655 - sparse_categorical_accuracy: 0.5363275/313 [=========================>....] - ETA: 1s - loss: 1.2663 - sparse_categorical_accuracy: 0.5365277/313 [=========================>....] - ETA: 1s - loss: 1.2666 - sparse_categorical_accuracy: 0.5367279/313 [=========================>....] - ETA: 1s - loss: 1.2671 - sparse_categorical_accuracy: 0.5370281/313 [=========================>....] - ETA: 1s - loss: 1.2682 - sparse_categorical_accuracy: 0.5371283/313 [==========================>...] - ETA: 1s - loss: 1.2694 - sparse_categorical_accuracy: 0.5367285/313 [==========================>...] - ETA: 1s - loss: 1.2688 - sparse_categorical_accuracy: 0.5364287/313 [==========================>...] - ETA: 0s - loss: 1.2685 - sparse_categorical_accuracy: 0.5369289/313 [==========================>...] - ETA: 0s - loss: 1.2670 - sparse_categorical_accuracy: 0.5376291/313 [==========================>...] - ETA: 0s - loss: 1.2675 - sparse_categorical_accuracy: 0.5375293/313 [===========================>..] - ETA: 0s - loss: 1.2674 - sparse_categorical_accuracy: 0.5372295/313 [===========================>..] - ETA: 0s - loss: 1.2670 - sparse_categorical_accuracy: 0.5373297/313 [===========================>..] - ETA: 0s - loss: 1.2669 - sparse_categorical_accuracy: 0.5372299/313 [===========================>..] - ETA: 0s - loss: 1.2668 - sparse_categorical_accuracy: 0.5374301/313 [===========================>..] - ETA: 0s - loss: 1.2651 - sparse_categorical_accuracy: 0.5378303/313 [============================>.] - ETA: 0s - loss: 1.2652 - sparse_categorical_accuracy: 0.5379305/313 [============================>.] - ETA: 0s - loss: 1.2664 - sparse_categorical_accuracy: 0.5374307/313 [============================>.] - ETA: 0s - loss: 1.2665 - sparse_categorical_accuracy: 0.5366309/313 [============================>.] - ETA: 0s - loss: 1.2678 - sparse_categorical_accuracy: 0.5364311/313 [============================>.] - ETA: 0s - loss: 1.2681 - sparse_categorical_accuracy: 0.5364313/313 [==============================] - ETA: 0s - loss: 1.2678 - sparse_categorical_accuracy: 0.5367313/313 [==============================] - 12s 36ms/step - loss: 1.2678 - sparse_categorical_accuracy: 0.5367
Test accuracy: 53.67%
Execution time: 932.8190588951111
